; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	instrument3 - instrument
	satellite1 - satellite
	instrument4 - instrument
	satellite2 - satellite
	instrument5 - instrument
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	satellite3 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	instrument12 - instrument
	satellite4 - satellite
	instrument13 - instrument
	instrument14 - instrument
	image2 - mode
	thermograph0 - mode
	image1 - mode
	Star11 - direction
	Star9 - direction
	Star7 - direction
	Star5 - direction
	Star0 - direction
	GroundStation1 - direction
	GroundStation14 - direction
	Star4 - direction
	GroundStation10 - direction
	GroundStation6 - direction
	GroundStation2 - direction
	GroundStation13 - direction
	GroundStation12 - direction
	GroundStation3 - direction
	GroundStation8 - direction
	Phenomenon15 - direction
	Phenomenon16 - direction
	Phenomenon17 - direction
	Planet18 - direction
	Star19 - direction
)
(:init
	(supports instrument0 image2)
	(supports instrument0 thermograph0)
	(supports instrument0 image1)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 thermograph0)
	(supports instrument1 image1)
	(supports instrument1 image2)
	(calibration_target instrument1 GroundStation12)
	(supports instrument2 image1)
	(calibration_target instrument2 Star9)
	(calibration_target instrument2 GroundStation12)
	(calibration_target instrument2 GroundStation6)
	(supports instrument3 thermograph0)
	(supports instrument3 image1)
	(calibration_target instrument3 GroundStation3)
	(calibration_target instrument3 GroundStation6)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(on_board instrument3 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation13)
	(supports instrument4 image1)
	(supports instrument4 image2)
	(calibration_target instrument4 GroundStation10)
	(calibration_target instrument4 GroundStation6)
	(calibration_target instrument4 Star7)
	(on_board instrument4 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation2)
	(supports instrument5 image1)
	(supports instrument5 thermograph0)
	(calibration_target instrument5 GroundStation14)
	(calibration_target instrument5 GroundStation8)
	(calibration_target instrument5 GroundStation6)
	(calibration_target instrument5 Star0)
	(supports instrument6 image2)
	(supports instrument6 thermograph0)
	(calibration_target instrument6 Star5)
	(calibration_target instrument6 GroundStation8)
	(calibration_target instrument6 GroundStation2)
	(calibration_target instrument6 GroundStation1)
	(calibration_target instrument6 GroundStation13)
	(supports instrument7 thermograph0)
	(supports instrument7 image2)
	(calibration_target instrument7 GroundStation6)
	(calibration_target instrument7 GroundStation10)
	(supports instrument8 image2)
	(calibration_target instrument8 Star4)
	(calibration_target instrument8 GroundStation1)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(on_board instrument8 satellite2)
	(power_avail satellite2)
	(pointing satellite2 GroundStation14)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 GroundStation14)
	(calibration_target instrument9 Star0)
	(calibration_target instrument9 GroundStation13)
	(calibration_target instrument9 GroundStation8)
	(calibration_target instrument9 GroundStation2)
	(supports instrument10 thermograph0)
	(supports instrument10 image1)
	(calibration_target instrument10 GroundStation14)
	(calibration_target instrument10 Star0)
	(calibration_target instrument10 Star4)
	(supports instrument11 image2)
	(supports instrument11 thermograph0)
	(calibration_target instrument11 Star4)
	(calibration_target instrument11 GroundStation3)
	(calibration_target instrument11 GroundStation14)
	(calibration_target instrument11 GroundStation1)
	(calibration_target instrument11 GroundStation10)
	(supports instrument12 image1)
	(supports instrument12 thermograph0)
	(calibration_target instrument12 GroundStation6)
	(calibration_target instrument12 GroundStation10)
	(on_board instrument9 satellite3)
	(on_board instrument10 satellite3)
	(on_board instrument11 satellite3)
	(on_board instrument12 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star4)
	(supports instrument13 image2)
	(supports instrument13 image1)
	(calibration_target instrument13 GroundStation12)
	(calibration_target instrument13 GroundStation3)
	(calibration_target instrument13 GroundStation13)
	(calibration_target instrument13 GroundStation2)
	(supports instrument14 image2)
	(supports instrument14 image1)
	(supports instrument14 thermograph0)
	(calibration_target instrument14 GroundStation8)
	(calibration_target instrument14 GroundStation3)
	(on_board instrument13 satellite4)
	(on_board instrument14 satellite4)
	(power_avail satellite4)
	(pointing satellite4 GroundStation6)
)
(:goal (and
	(pointing satellite0 Phenomenon17)
	(pointing satellite3 GroundStation8)
	(have_image Phenomenon15 thermograph0)
	(have_image Phenomenon16 image2)
	(have_image Phenomenon17 thermograph0)
	(have_image Planet18 image2)
	(have_image Star19 image2)
))

)

; plan
1. (turn_to satellite3 groundstation8 star4)
   deleted: (pointing satellite3 star4)
   added: (pointing satellite3 groundstation8)
   goals met: 1 of 7
2. (turn_to satellite0 groundstation2 groundstation13)
   deleted: (pointing satellite0 groundstation13)
   added: (pointing satellite0 groundstation2)
   goals met: 1 of 7
3. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 1 of 7
4. (calibrate satellite0 instrument0 groundstation2)
   added: (calibrated instrument0)
   goals met: 1 of 7
5. (turn_to satellite0 phenomenon16 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 phenomenon16)
   goals met: 1 of 7
6. (take_image satellite0 phenomenon16 instrument0 image2)
   added: (have_image phenomenon16 image2)
   goals met: 2 of 7
7. (turn_to satellite0 phenomenon15 phenomenon16)
   deleted: (pointing satellite0 phenomenon16)
   added: (pointing satellite0 phenomenon15)
   goals met: 2 of 7
8. (take_image satellite0 phenomenon15 instrument0 thermograph0)
   added: (have_image phenomenon15 thermograph0)
   goals met: 3 of 7
9. (turn_to satellite0 planet18 phenomenon15)
   deleted: (pointing satellite0 phenomenon15)
   added: (pointing satellite0 planet18)
   goals met: 3 of 7
10. (take_image satellite0 planet18 instrument0 image2)
   added: (have_image planet18 image2)
   goals met: 4 of 7
11. (turn_to satellite0 star19 planet18)
   deleted: (pointing satellite0 planet18)
   added: (pointing satellite0 star19)
   goals met: 4 of 7
12. (take_image satellite0 star19 instrument0 image2)
   added: (have_image star19 image2)
   goals met: 5 of 7
13. (turn_to satellite0 phenomenon17 star19)
   deleted: (pointing satellite0 star19)
   added: (pointing satellite0 phenomenon17)
   goals met: 6 of 7
14. (take_image satellite0 phenomenon17 instrument0 thermograph0)
   added: (have_image phenomenon17 thermograph0)
   goals met: 7 of 7
